package lesson1_2.levelA.a3;

/*
В классе Run создайте константу, которая будет хранить в себе номер месяца вашего рождения.
Выведите значение константы в консоль.
 */
public class Run {
    public static void main(String[] args) {
        final int numberMonthOfBrith = 1;
        System.out.println(numberMonthOfBrith);
    }
}
